RhinoInside.Revit API Documentation
GeometryEncoder.ToCurveArray Method
 Converts the specified Rhino.Geometry.Curve to an equivalent of Autodesk.Revit.DB.CurveArray.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8026
Syntax
public static Autodesk.Revit.DB.CurveArray ToCurveArray(
	this Rhino.Geometry.Curve curve
)
@staticmethod
def ToCurveArray(
	curve: Rhino.Geometry.Curve
) -> Autodesk.Revit.DB.CurveArray
Parameters
curve
Type: Rhino.Geometry.Curve
Rhino curve to convert.
Return Value
Type: Autodesk.Revit.DB.CurveArray
Revit curveArray that contains consecutive segments of provided Rhino curve.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Rhino.Geometry.Curve. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
Examples
 Using ToCurveArray(Curve) as extension method:
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.Geometry;
DB.CurveArray revitCurveArray = rhinoCurve.ToCurveArray();
import clr
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.Geometry
clr.ImportExtensions(RhinoInside.Revit.Convert.Geometry)
revit_curvearray = rhino_curve.ToCurveArray()    # type: DB.CurveArray
 Using ToCurveArray(Curve) as static method:
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.Geometry;
DB.CurveArray revitCurveArray = GeometryEncoder.ToCurveArray(rhinoCurve);
import clr
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.Geometry.GeometryEncoder as GE
revit_curvearray = GE.ToCurveArray(rhino_curve)    # type: DB.CurveArray
See Also
Reference
GeometryEncoder Class
RhinoInside.Revit.Convert.Geometry Namespace